using System;

namespace Lesson1
{
	class Program
	{
		static void Main(string[] args)
		{
			
		}

		/// <summary>
		/// Составить программу вывода на экран числа, вводимого с клавиатуры.
		/// Выводимому числу должно предшествовать сообщение «Вы ввели число».
		/// </summary>
		private static void Func1()
		{

		}

		/// <summary>
		/// Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.
		/// </summary>
		private static void Func2()
		{

		}

		/// <summary>
		/// Составить программу вывода на экран «столбиком» четырех любых чисел.
		/// </summary>
		private static void Func3()
		{

		}

		/// <summary>
		/// вычислить значение функции y=7x^2+3x+6 при любом значении x
		/// </summary>
		private static void Func4()
		{

		}

		/// <summary>
		/// вычислить значение функции y=7x^2+x/3+6 при любом значении x
		/// </summary>
		private static void Func5()
		{

		}

		/// <summary>
		/// Даны два целых числа. Найти:
		/// а) их среднее арифметическое;
		/// б) их среднее геометрическое.
		/// </summary>
		private static void Func6()
		{

		}

		/// <summary>
		/// Составить программу решения линейного уравнения ax+b=0
		/// при целочисленных a и b
		/// </summary>
		private static void Func7()
		{

		}

		/// <summary>
		/// Дано вещественное число а. Пользуясь только операцией умножения, получить:
		/// а) a4 за две операции;
		/// б) a6 за три операции;
		/// в) a7 за четыре операции;
		/// г) a8 за три операции;
		/// д) a9 за четыре операции;
		/// е) a10 за четыре операции.
		/// </summary>
		private static void Func8()
		{

		}

		/// <summary>
		/// Дано двузначное число. Найти:
		/// а) число десятков в нем;
		/// б) число единиц в нем;
		/// в) сумму его цифр;
		/// г) произведение его цифр.
		/// </summary>
		private static void Func10()
		{

		}

		/// <summary>
		/// Дано трехзначное число. Найти число, полученное при прочтении его цифр справа налево.
		/// </summary>
		private static void Func11()
		{

		}

		/// <summary>
		/// Дано трехзначное число. В нем зачеркнули первую слева цифру и приписали ее в конце. Найти полученное число.
		/// </summary>
		private static void Func12()
		{

		}

		/// <summary>
		/// Дано натуральное число n (n > 9). Найти:
		/// а) число единиц в нем;
		/// б) число десятков в нем.
		/// </summary>
		private static void Func13()
		{

		}

		/// <summary>
		/// Даны два целых числа a и b.
		/// Если a делится на b или b делится на a, то вывести 1, иначе — любое другое число. 
		/// </summary>
		private static void Func15()
		{
		}

		#region Уух сложна

		/// <summary>
		/// С начала суток прошло n секунд. Определить:
		/// а) сколько полных часов прошло с начала суток;
		/// б) сколько полных минут прошло с начала очередного часа;
		/// в) сколько полных секунд прошло с начала очередной минуты.
		/// </summary>
		private static void Func9()
		{

		}

		/// <summary>
		/// С начала суток часовая стрелка повернулась на y градусов (0 ≤ y ≤ 360, y — вещественное число).
		/// Определить число полных часов и число полных минут, прошедших с начала суток.
		/// </summary>
		private static void Func14()
		{

		}

		#endregion
	}
}
