using System;

namespace Functions
{
	/// <summary>
	/// 1. Реализовать обобщенные функции для поиска мин и макс значения .MinCustom, .MaxCustom
	/// в массиве с касотмной функцией сравнения
	///
	/// 2. Реализовать функцию фильтрацию элементов массива .Filter
	/// с кастомной функцией условия
	///
	/// 3. Реализовать обобщенную функцию сортировки массива .Sort
	/// с кастомной функцией сравнения
	///
	/// 4. Реализовать обобщенную функцию перемешки массива .Mix
	///
	/// 5. Реализовать обобщенную функцию вывода массива .PrintWhere
	/// c кастомной функцией фильтрации
	///
	/// 6. Реализовать обобщенную функцию добавления элемента в массив .AddAfter
	/// после элемента, удовлетворяющего условию кастомной функции
	///
	/// 7. Реализовать обобщенную функцию удаления элемента(ов) из массива .RemoveWhere
	/// с кастомной функцией условия
	///
	/// 8. Реализовать обобщенную функцию подсчета количества элементов в массиве .CountWhere
	/// с кастомной функцией условия
	///
	/// 9. Реализовать функцию IndexesOfWhere, возвращающую индексы элементов обобщенного массива
	/// с кастомной функцией фильтрации
	///
	/// 10. Реализовать рекурсивную обобщенную функцию суммирования .SumRec
	/// элементов массива с кастомной функцией сложения
	/// </summary>
	public class GenericFunctions
	{
	}
}
