using System;

namespace Functions
{
	/// <summary>
	/// 1. Реализовать обобщеную функцию для поиска мин и макс значения
	/// в массиве с касотмной функцией сравнения
	///
	/// 2. Реализовать фильтрацию элементов массива
	/// с кастомной функцией условия
	///
	/// 3. Реализовать обобщенную функцию сортировки массива
	/// с кастомной функцией сравнения
	///
	/// 4. Реализовать обобщенную функцию перемешки массива
	///
	/// 5. Реализовать обобщенную функцию вывода массива
	///
	/// 6. Реализовать обобщенную функцию добавления элемента в массив
	///
	/// 7. Реализовать обобщенную функцию удаления элемента(ов) из массив
	/// с кастомной функцией условия
	///
	/// 8. Реализовать обобщенную функцию подсчета количества элементов
	/// в массиве с кастомной функцией условия
	///
	/// 9. Реализовать рекурсивную обобщенную функцию суммирования
	/// элементов массива с кастомной функцией сложения
	/// </summary>
	public class GenericFunctions
	{
	}
}
